#include "unit/graphics/window/spranim.h"
#include "types.h"

// カーソルの上下
const u8 UiSprite_CursorBobOffsets[80] =
{
	0, 1, 1, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5,
	5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7,
	7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 7, 7, 7,
	7, 7, 7, 7, 7, 6, 6, 6, 6, 6, 6, 6, 5, 5, 5, 5,
	5, 5, 4, 4, 4, 4, 4, 3, 3, 3, 3, 2, 2, 2, 1, 1,
};

// 半径 4 の円
const s8 UiSprite_WobbleOffsets[40] =
{
	0, 4, 1, 4, 2, 3, 3, 2,
	4, 1, 4, 0, 4, 1, 3, 2,
	2, 3, 1, 4, 0, 4, -1, 4,
	-2, 3, -3, 2, -4, 1, -4, 0,
	-4, 1, -3, 2, -2, 3, -1, 4,
};

const u8 UiSprite_WobbleTail[16] =
{
	4, 3, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
};

// 弾み
const u8 UiSprite_BounceOffsets[16] =
{
	0, 1, 1, 2, 3, 4, 6, 8, 6, 4, 3, 2, 1, 1, 0, 0,
};
