//--------------------------------------------------------------------------
// adjust_value_without_limit.c
// ウィンドウ：メッセージを長さの制限なしに文字列にする
//--------------------------------------------------------------------------

#include "types.h"
#include "scene.h"
#include "window.h"

//--------------------------------------------------------------------------
// メッセージ mes を buf に展開する（長さの上限なし）
//--------------------------------------------------------------------------
void Ui_AdjustValueWithoutLimit(s32 mes, s32 buf)
{
	UiText_DecodeMessage(mes, buf, 0x7fffffff);
}
