//--------------------------------------------------------------------------
// DATA_GET_RESOURCE_GROUP.C
// シーン表：シーンのグループ番号
//--------------------------------------------------------------------------

#include "TYPES.H"
#include "FIELDRUN.H"

//--------------------------------------------------------------------------
// シーンが属するグループを返す
// scene : シーン番号
//--------------------------------------------------------------------------
s8 BattleFx_GetResourceGroup(s32 scene)
{
	return Field_SceneTable[scene].group;
}
