#include "TYPES.H"
#include "CHARA.H"

// {キャラ番号, 顔番号} の組, -1 で終わり
const s16 SideObject_CharacterIdMap[20] =
{
	ROBIN, ROBIN,			/* ロビン */
	18, 56,					/* ロビン(こ) */
	GERALD, GERALD,			/* ジェラルド */
	19, 57,					/* ジェラルド(こ) */
	IWAN, IWAN,				/* イワン */
	MEARI, MEARI,			/* メアリー */
	GARUSHIA, GARUSHIA,		/* ガルシア */
	JASMINE, JASMINE,		/* ジャスミン */
	SHIBA, SHIBA,			/* シバ */
	-1, -1,
};

const s16 SideObject_ActorKindIdMap[100] =
{
	93, 0,
	90, 1,
	92, 2,
	91, 3,
	30, 4,
	32, 5,
	33, 6,
	43, 7,
	31, 8,
	53, 9,
	38, 10,
	42, 11,
	37, 12,
	54, 13,
	58, 14,
	69, 15,
	71, 16,
	56, 17,
	51, 18,
	49, 19,
	45, 20,
	40, 21,
	39, 22,
	41, 23,
	44, 24,
	50, 25,
	52, 26,
	57, 27,
	61, 28,
	47, 29,
	46, 30,
	66, 31,
	67, 32,
	121, 33,
	122, 34,
	124, 35,
	125, 36,
	118, 37,
	128, 38,
	119, 39,
	18, 40,
	19, 41,
	36, 42,
	48, 43,
	34, 44,
	55, 45,
	35, 46,
	65, 47,
	70, 48,
	-1, -1,
};
