//--------------------------------------------------------------------------
// data_get_resource_group.c
// シーン表：シーンのグループ番号
//--------------------------------------------------------------------------

#include "types.h"
#include "fieldrun.h"

//--------------------------------------------------------------------------
// シーンが属するグループを返す
// scene : シーン番号
//--------------------------------------------------------------------------
s8 BattleFx_GetResourceGroup(s32 scene)
{
	return Field_SceneTable[scene].group;
}
