//--------------------------------------------------------------------------
// check_status_or_special_id.c
// バトル：PP を使うわざの判定
//--------------------------------------------------------------------------

#include "btlsys.h"

//--------------------------------------------------------------------------
// PP を使うわざなら 1 を返す。エナジードレインは PP に関係なく 1
// act_no : わざ番号
//--------------------------------------------------------------------------
u32 Ability_CheckStatusOrSpecialId(s32 act_no)
{
	u8 pp;

	if (act_no == 126) // エナジードレイン
		return 1;
	pp = BtlActGet(act_no)->pp_cost;
	return (u32)((0 - pp) | pp) >> 31; // pp が 0 でなければ 1
}
