//--------------------------------------------------------------------------
// check_status_or_special_id.c
// バトル：EP を使うわざの判定
//--------------------------------------------------------------------------

#include "btlsys.h"

//--------------------------------------------------------------------------
// EP を使うわざなら 1 を返す。エナジードレインは EP に関係なく 1
// act_no : わざ番号
//--------------------------------------------------------------------------
u32 Ability_CheckStatusOrSpecialId(s32 act_no)
{
	u8 ep;

	if (act_no == 126) // エナジードレイン
		return 1;
	ep = BtlActGet(act_no)->pp_cost;
	return (u32)((0 - ep) | ep) >> 31; // ep が 0 でなければ 1
}
