//--------------------------------------------------------------------------
// contains_id.c
// バトル：ユニット番号リストの検索
//--------------------------------------------------------------------------

#include "types.h"

//--------------------------------------------------------------------------
// 並び番号のユニットがリストにいれば 1 を返す
// list : ユニット番号のリスト（0xff で終わる、最大 14）
// no   : 並び番号（0-7 味方、8-13 敵）
//--------------------------------------------------------------------------
s32 BattlePlacement_ContainsId(s16 *list, s32 no)
{
    u32 i;

    if (no > 7)
        no += 120; // 敵のユニット番号は 128 から
    i = 0;
    do
    {
        u16 id = *list++;

        if (id == 0xff)
            break;
        if (id == no)
            return 1;
    } while (++i < 14);
    return 0;
}
